/* 
  NSError+BeanstalkAPI.strings
  BeanstalkAPI

  Created by Alexander Rinaß on 14.06.12.
  Copyright (c) 2012 Fournova GmbH. All rights reserved.
*/

"CONNECTION_ERROR_DESCRIPTION" = "Unable to Connect to Beanstalk Server";

"SERVER_ERROR_DESCRIPTION" = "A Beanstalk Server Error Occurred";
"SERVER_ERROR_FAILURE_REASON" = "An internal server error occured. Please try again later.";

"ACCOUNT_NOT_FOUND_ERROR_DESCRIPTION" = "Account Not Found";
"ACCOUNT_NOT_FOUND_ERROR_FAILURE_REASON" = "The account domain does not exist. Please verify your authentication information and try again.";

"AUTHENTICATION_ERROR_DESCRIPTION" = "Authentication Failed With Beanstalk";
"AUTHENTICATION_ERROR_FAILURE_REASON" = "Please verify your authentication information and try again.";

"RESOURCE_NOT_FOUND_ERROR_DESCRIPTION" = "Beanstalk API Resource Not Found";
"RESOURCE_NOT_FOUND_ERROR_FAILURE_REASON" = "The Beanstalk API resource could not be found.";

"RESPONSE_PARSER_ERROR_DESCRIPTION" = "A Beanstalk API Error Occurred";
"RESPONSE_PARSER_ERROR_FAILURE_REASON" = "There was an error parsing the response for the request. Please try again later.";

"API_ERROR_DESCRIPTION" = "A Beanstalk API Error Occurred";
